"""
          _____                   _____                   _____            _____                   _____                   _____
         /\    \                 /\    \                 /\    \          /\    \                 /\    \                 /\    \
        /::\    \               /::\____\               /::\    \        /::\    \               /::\    \               /::\____\
       /::::\    \             /:::/    /               \:::\    \       \:::\    \             /::::\    \             /:::/    /
      /::::::\    \           /:::/   _/___              \:::\    \       \:::\    \           /::::::\    \           /:::/    /
     /:::/\:::\    \         /:::/   /\    \              \:::\    \       \:::\    \         /:::/\:::\    \         /:::/    /
    /:::/__\:::\    \       /:::/   /::\____\              \:::\    \       \:::\    \       /:::/  \:::\    \       /:::/____/
    \:::\   \:::\    \     /:::/   /:::/    /              /::::\    \      /::::\    \     /:::/    \:::\    \     /::::\    \
  ___\:::\   \:::\    \   /:::/   /:::/   _/___   ____    /::::::\    \    /::::::\    \   /:::/    / \:::\    \   /::::::\    \   _____
 /\   \:::\   \:::\    \ /:::/___/:::/   /\    \ /\   \  /:::/\:::\    \  /:::/\:::\    \ /:::/    /   \:::\    \ /:::/\:::\    \ /\    \
/::\   \:::\   \:::\____|:::|   /:::/   /::\____/::\   \/:::/  \:::\____\/:::/  \:::\____/:::/____/     \:::\____/:::/  \:::\    /::\____\
\:::\   \:::\   \::/    |:::|__/:::/   /:::/    \:::\  /:::/    \::/    /:::/    \::/    \:::\    \      \::/    \::/    \:::\  /:::/    /
 \:::\   \:::\   \/____/ \:::\/:::/   /:::/    / \:::\/:::/    / \/____/:::/    / \/____/ \:::\    \      \/____/ \/____/ \:::\/:::/    /
  \:::\   \:::\    \      \::::::/   /:::/    /   \::::::/    /       /:::/    /           \:::\    \                      \::::::/    /
   \:::\   \:::\____\      \::::/___/:::/    /     \::::/____/       /:::/    /             \:::\    \                      \::::/    /
    \:::\  /:::/    /       \:::\__/:::/    /       \:::\    \       \::/    /               \:::\    \                     /:::/    /
     \:::\/:::/    /         \::::::::/    /         \:::\    \       \/____/                 \:::\    \                   /:::/    /
      \::::::/    /           \::::::/    /           \:::\    \                               \:::\    \                 /:::/    /
       \::::/    /             \::::/    /             \:::\____\                               \:::\____\               /:::/    /
        \::/    /               \::/____/               \::/    /                                \::/    /               \::/    /
         \/____/                 ~~                      \/____/                                  \/____/                 \/____/

        .aMMMMMMMMMn.  ,aMMMn.
      .aMccccccccc*lYMMn.     ‘Hb
     aMccccccccccccccccc*Mn     MP
    .AMMMMn.     MM ‘*YMMY*ccaM*
   dM*  *YMMb    YP        'cMY
   YM.  .dMMP     aMn.     .cMP
    *YMMn.       aMHHMHHHMHHY'
      .'YMMb.           ccMP
   .dMcccccc*Mc....cMb.cMP'
 .dMMMMb;cccc*Mbcccc,IMMMMMMMn.
dY*‘   '*H:ccccMM..dHMM..MP*cc*Mb
YH.     ,MbccMMMMMMMMMMMM*cccc;NP
 *Mbn:aMMMMMMMMMMMMMMMMMIcccc:M*
dpcccccIMMMMMMMMMMMMMMMMMa:c;MP
Yb;cc;dMMMMMMMMMMMMP*'  *YMMP*
 *YMMMPYMMMMMMMP*'



        .aMMMMMMMMMn=    aMMMn
        .aMMMMMMMMMn=    aMMMn


丶丶丶丶丶,aMMMMMMMMMn=    aMMMn
丶丶丶丶,aMcccccccccllYMM=     丶H)
丶丶丶aMccccccccccccccccc*Mn     #P
丶丶ʃAMMMMnɕ     #= ‘*YMMY*ccaM'
丶丶dM*  *YMMb    YP        'cM'
丶丶YM.  .dMMP     aMn.     .cMP
丶丶丶*YMMn.       aMHHMHHHMHHY'
丶丶丶丶,'YMMb.           ccMP
丶丶,dMcccccc*Mc....cMb.cMP'
丶,dMMMMb;cccc*Mbcccc,IMMMMMMMn.
dY*‘   '*H:ccccMM..dHMM..MP*cc*Mb
YH.     ,MbccMMMMMMMMMMMM*cccc;NP
丶*Mbn:aMMMMMMMMMMMMMMMMMIcccc:M*
dpcccccIMMMMMMMMMMMMMMMMMa:c;MP
Yb;cc;dMMMMMMMMMMMMP*'  *YMMP*
丶*YMMMPYMMMMMMMP*'


丶丶丶丶丶,aMMMMMMMMMn=    aMMMn
丶丶丶丶,aMcccccccccllYMM=     丶H)
丶丶丶aMccccccc=[:MMMMMMMMM]     #P
丶丶ʃAMMMMnɕ     #= ‘*YMMY*ccaM'
丶丶dM*  *YMMb    YP        'cM'
丶丶YM.  .dMMP     aMn.     .cMP
丶丶丶*YMMn.       aMHHMHHHMHHY'
丶丶丶丶,'YMMb.           ccMP
丶丶,dMcccccc*Mc....cMb.cMP'
丶,dMMMMb;cccc*Mbcccc,IMMMMMMMn.
dY*‘   '*H:ccccMM..dHMM..MP*cc*Mb
YH.     ,MbccMMMMMMMMMMMM*cccc;NP
丶*Mbn:aMMMMMMMMMMMMMMMMMIcccc:M*
dpcccccIMMMMMMMMMMMMMMMMMa:c;MP
Yb;cc;dMMMMMMMMMMMMP*'  *YMMP*
丶*YMMMPYMMMMMMMP*'
"""



import IIII
ㅇ = 'i'
l = 'want'
o = 'a'
I = 'nintendo'
ㅣ = 'switch'
O = '!!!'
ㅡ = 'and'
ㄴ = 'love'
ㄱ = 'swm'
Ѓ = '!!'
ι = 'ㅎㅎ'
Γ = 'ㅎㅎㅎ'
ᚙ = 'ㅏㅏㅏㅏ'
ㅁㅁㅁㅁᚙᚙㅁㅁ = 'ㅇㄴ'
ㅁㅁᚙᚙㅁㅁ='ㅇ'
ㅁᚙᚙㅁㅁ='ㅇㄷㅈ'
ㅁᚙᚙᚙᚙ='ㅇㅈ'
ㅢ:'ㅇㅈㅂㅇ'
𪚥 = 'ㅇㅂㅈㅇ'

from IIII import aMM, cMb
丶Hb = 'I'
丶丶ʃAMMMMnɕ = 'want'
Mc = 'a'
_ = 'switch'
cccc = 'swm'
Mbcccc = 'fighting'
IMMMMMMMn = 'faew'

def ʃ(n, ㅣ丶ʃAMMMMnɕ=None):


    ________,aMMMMMMMMMn=    aMM(n)
    ㅣ丶丶丶,aMcccccccccllYMM=     丶Hb
    ㅣ,   aMccc=n[:aMMMMMMMMMn]     #P
    ㅣ丶ʃAMMMMnɕ     += '*YMMY*ccaM'
    #  dM*  *YMMb    YP         'cM'
    #  YM.  .dMMP     aMn.      .cMP
    ㅣ,   lYMM=       n[aMMMMMMMMMn:]
    ㅣ,    'YMMb,            ccMP'
    ㅣ,  ʃ(aMccc),Mc,_  ,cMb.cMP#
    ㅣ,ʃ(lYMM);cccc*Mbcccc,IMMMMMMMn,
    dY*‘   '*H:ccccMM..dHMM..MP*cc*Mb
    YH.     ,MbccMMMMMMMMMMMM*cccc;NP
    丶*Mbn:aMMMMMMMMMMMMMMMMMIcccc:M*
    dpcccccIMMMMMMMMMMMMMMMMMa:c;MP
    Yb;cc;dMMMMMMMMMMMMP*'  *YMMP*
    丶*YMMMPYMMMMMMMP*'


def IIIl(l1ll):
    if IIII.lIIl(IIII.llll(l1ll)):
        return l1ll

    Γㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ𪚥𪚥𪚥ㅡㅡㅡㅡ=ㄱ
    l丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥丶=ㅣ
    l丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥丶=ㅣ
    l丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶=ㅣ
    ㄴㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ = ㅢ


    Γㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ=ㄱ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    ㄴㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ = ㅢ


    Γㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ=ㄱ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    ㄴㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ = ㅢ









    lllI            =         IIII.lIlI(IIII.llll(l1ll))

    llIl      =       l1ll[:lllI]
    llII = l1ll[lllI:]
    lIll = IIIl(llIl)
    lI1I = IIIl(llII)
    lIIl = lIII = IIII.lIII()
    Illl = []
    while lIIl < IIII.llll(lIll) and lIII < IIII.llll(lI1I):
        if lIll[lIIl] < lI1I[lIII]:
            IIII.lllI(Illl, lIll[lIIl])
            lIIl+=1
        else:
            IIII.lllI(Illl, lI1I[lIII])
            lIII+=1
    Illl += lIll[lIIl:]
    Illl += lI1I[lIII:]

    return Illl



print(IIIl([2,3,4,1,6,3,8]))