"""
          _____                   _____                   _____            _____                   _____                   _____
         /\    \                 /\    \                 /\    \          /\    \                 /\    \                 /\    \
        /::\    \               /::\____\               /::\    \        /::\    \               /::\    \               /::\____\
       /::::\    \             /:::/    /               \:::\    \       \:::\    \             /::::\    \             /:::/    /
      /::::::\    \           /:::/   _/___              \:::\    \       \:::\    \           /::::::\    \           /:::/    /
     /:::/\:::\    \         /:::/   /\    \              \:::\    \       \:::\    \         /:::/\:::\    \         /:::/    /
    /:::/__\:::\    \       /:::/   /::\____\              \:::\    \       \:::\    \       /:::/  \:::\    \       /:::/____/
    \:::\   \:::\    \     /:::/   /:::/    /              /::::\    \      /::::\    \     /:::/    \:::\    \     /::::\    \
  ___\:::\   \:::\    \   /:::/   /:::/   _/___   ____    /::::::\    \    /::::::\    \   /:::/    / \:::\    \   /::::::\    \   _____
 /\   \:::\   \:::\    \ /:::/___/:::/   /\    \ /\   \  /:::/\:::\    \  /:::/\:::\    \ /:::/    /   \:::\    \ /:::/\:::\    \ /\    \
/::\   \:::\   \:::\____|:::|   /:::/   /::\____/::\   \/:::/  \:::\____\/:::/  \:::\____/:::/____/     \:::\____/:::/  \:::\    /::\____\
\:::\   \:::\   \::/    |:::|__/:::/   /:::/    \:::\  /:::/    \::/    /:::/    \::/    \:::\    \      \::/    \::/    \:::\  /:::/    /
 \:::\   \:::\   \/____/ \:::\/:::/   /:::/    / \:::\/:::/    / \/____/:::/    / \/____/ \:::\    \      \/____/ \/____/ \:::\/:::/    /
  \:::\   \:::\    \      \::::::/   /:::/    /   \::::::/    /       /:::/    /           \:::\    \                      \::::::/    /
   \:::\   \:::\____\      \::::/___/:::/    /     \::::/____/       /:::/    /             \:::\    \                      \::::/    /
    \:::\  /:::/    /       \:::\__/:::/    /       \:::\    \       \::/    /               \:::\    \                     /:::/    /
     \:::\/:::/    /         \::::::::/    /         \:::\    \       \/____/                 \:::\    \                   /:::/    /
      \::::::/    /           \::::::/    /           \:::\    \                               \:::\    \                 /:::/    /
       \::::/    /             \::::/    /             \:::\____\                               \:::\____\               /:::/    /
        \::/    /               \::/____/               \::/    /                                \::/    /               \::/    /
         \/____/                 ~~                      \/____/                                  \/____/                 \/____/
"""












ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ = 'Hi Software Maestro!'

丶Hb = 'I'
Mc = 'want'
_ = 'a'
IMMMMMMMn = 'switch'
cccc = 2018
Mbcccc = 9
dY = 123456789
MMMMMMM = 'I'
NP = 'want'
ιMbn = 'to'
Mຯ='play'
c = 'super'
MP='mario'
ι = 'ㅎㅎ'







from IIII import aMM, cMb, ccccMMM, dpcccccIMMMMMMMMMMMMMMM
def ʃ(n, ʃAMMMMnɕ='', ㅣ=None):
    if len(n) <= 1:
        return

    ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
    ㅣ                                                        ;
    ㅣ,              aMMMMMMMMMn=    aMM(n)                   ;
    ㅣ;            aMcccccccccllYMM=     丶Hb                 ;
    ㅣ=          aMccc=n[:aMMMMMMMMMn]     #P                 ;
    ㅣ;         ʃAMMMMnɕ     += '*YMMY*ccaM'                  ;
    #          dM*  *YMMb    YP         'cM'                  ;
    #          YM.  .dMMP     aMn.      .cMP                  ;
    ㅣ;          lYMM=       n[aMMMMMMMMMn:]                  ;
    ㅣ,           'YMMb,            ccMP'                     ;
    ㅣ,         ʃ(aMccc),Mc,_  ,cMb.cMP#                      ;
    ㅣ,       ʃ(lYMM);cccc*Mbcccc,IMMMMMMMn,                  ;
    ㅣ;     dY*ι   ;M,H=ccccMMM(aMccc,lYMM,n)                 ;
    ㅣ;     n+=     aMccc[M:];MMMMMMM,cccc;NP                 ;
    ㅣ;      ιMbn;n+=lYMM[H:];MMMMMMMIcccc:Mຯ                 ;
    ㅣ;     dpcccccIMMMMMMMMMMMMMMM(n);c;MP                   ;
    ㅣ;     #b;cc;dMMMMMMMMMMMMP*'  *YMMP*                    ;
    ㅣ;      'YMMMPYMMMMMMMP*'                                ;
    ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ




a= [1,23,1,23,43,3]
ʃ(a)
print(a)