"""
          _____                    _____                    _____                _____                    _____                    _____
         /\    \                  /\    \                  /\    \              /\    \                  /\    \                  /\    \
        /::\    \                /::\____\                /::\    \            /::\    \                /::\    \                /::\____\
       /::::\    \              /:::/    /                \:::\    \           \:::\    \              /::::\    \              /:::/    /
      /::::::\    \            /:::/   _/___               \:::\    \           \:::\    \            /::::::\    \            /:::/    /
     /:::/\:::\    \          /:::/   /\    \               \:::\    \           \:::\    \          /:::/\:::\    \          /:::/    /
    /:::/__\:::\    \        /:::/   /::\____\               \:::\    \           \:::\    \        /:::/  \:::\    \        /:::/____/
    \:::\   \:::\    \      /:::/   /:::/    /               /::::\    \          /::::\    \      /:::/    \:::\    \      /::::\    \
  ___\:::\   \:::\    \    /:::/   /:::/   _/___    ____    /::::::\    \        /::::::\    \    /:::/    / \:::\    \    /::::::\    \   _____
 /\   \:::\   \:::\    \  /:::/___/:::/   /\    \  /\   \  /:::/\:::\    \      /:::/\:::\    \  /:::/    /   \:::\    \  /:::/\:::\    \ /\    \
/::\   \:::\   \:::\____\|:::|   /:::/   /::\____\/::\   \/:::/  \:::\____\    /:::/  \:::\____\/:::/____/     \:::\____\/:::/  \:::\    /::\____\
\:::\   \:::\   \::/    /|:::|__/:::/   /:::/    /\:::\  /:::/    \::/    /   /:::/    \::/    /\:::\    \      \::/    /\::/    \:::\  /:::/    /
 \:::\   \:::\   \/____/  \:::\/:::/   /:::/    /  \:::\/:::/    / \/____/   /:::/    / \/____/  \:::\    \      \/____/  \/____/ \:::\/:::/    /
  \:::\   \:::\    \       \::::::/   /:::/    /    \::::::/    /           /:::/    /            \:::\    \                       \::::::/    /
   \:::\   \:::\____\       \::::/___/:::/    /      \::::/____/           /:::/    /              \:::\    \                       \::::/    /
    \:::\  /:::/    /        \:::\__/:::/    /        \:::\    \           \::/    /                \:::\    \                      /:::/    /
     \:::\/:::/    /          \::::::::/    /          \:::\    \           \/____/                  \:::\    \                    /:::/    /
      \::::::/    /            \::::::/    /            \:::\    \                                    \:::\    \                  /:::/    /
       \::::/    /              \::::/    /              \:::\____\                                    \:::\____\                /:::/    /
        \::/    /                \::/____/                \::/    /                                     \::/    /                \::/    /
         \/____/                  ~~                       \/____/                                       \/____/                  \/____/
          _____                   _____                   _____            _____                   _____                   _____
         /\    \                 /\    \                 /\    \          /\    \                 /\    \                 /\    \
        /::\    \               /::\____\               /::\    \        /::\    \               /::\    \               /::\____\
       /::::\    \             /:::/    /               \:::\    \       \:::\    \             /::::\    \             /:::/    /
      /::::::\    \           /:::/   _/___              \:::\    \       \:::\    \           /::::::\    \           /:::/    /
     /:::/\:::\    \         /:::/   /\    \              \:::\    \       \:::\    \         /:::/\:::\    \         /:::/    /
    /:::/__\:::\    \       /:::/   /::\____\              \:::\    \       \:::\    \       /:::/  \:::\    \       /:::/____/
    \:::\   \:::\    \     /:::/   /:::/    /              /::::\    \      /::::\    \     /:::/    \:::\    \     /::::\    \
  ___\:::\   \:::\    \   /:::/   /:::/   _/___   ____    /::::::\    \    /::::::\    \   /:::/    / \:::\    \   /::::::\    \   _____
 /\   \:::\   \:::\    \ /:::/___/:::/   /\    \ /\   \  /:::/\:::\    \  /:::/\:::\    \ /:::/    /   \:::\    \ /:::/\:::\    \ /\    \
/::\   \:::\   \:::\____|:::|   /:::/   /::\____/::\   \/:::/  \:::\____\/:::/  \:::\____/:::/____/     \:::\____/:::/  \:::\    /::\____\
\:::\   \:::\   \::/    |:::|__/:::/   /:::/    \:::\  /:::/    \::/    /:::/    \::/    \:::\    \      \::/    \::/    \:::\  /:::/    /
 \:::\   \:::\   \/____/ \:::\/:::/   /:::/    / \:::\/:::/    / \/____/:::/    / \/____/ \:::\    \      \/____/ \/____/ \:::\/:::/    /
  \:::\   \:::\    \      \::::::/   /:::/    /   \::::::/    /       /:::/    /           \:::\    \                      \::::::/    /
   \:::\   \:::\____\      \::::/___/:::/    /     \::::/____/       /:::/    /             \:::\    \                      \::::/    /
    \:::\  /:::/    /       \:::\__/:::/    /       \:::\    \       \::/    /               \:::\    \                     /:::/    /
     \:::\/:::/    /         \::::::::/    /         \:::\    \       \/____/                 \:::\    \                   /:::/    /
      \::::::/    /           \::::::/    /           \:::\    \                               \:::\    \                 /:::/    /
       \::::/    /             \::::/    /             \:::\____\                               \:::\____\               /:::/    /
        \::/    /               \::/____/               \::/    /                                \::/    /               \::/    /
         \/____/                 ~~                      \/____/                                  \/____/                 \/____/

  .-')     (`\ .-') /`        .-') _             ('-. .-.
 ( OO ).    `.( OO ),'       (  OO) )           ( OO )  /
(_)---\_),--./  .--.  ,-.-') /     '._  .-----. ,--. ,--.
/    _ | |      |  |  |  |OO)|'--...__)'  .--./ |  | |  |
\  :` `. |  |   |  |, |  |  \'--.  .--'|  |('-. |   .|  |
 '..`''.)|  |.'.|  |_)|  |(_/   |  |  /_) |OO  )|       |
.-._)   \|         | ,|  |_.'   |  |  ||  |`-'| |  .-.  |
\       /|   ,'.   |(_|  |      |  | (_'  '--'\ |  | |  |
 `-----' '--'   '--'  `--'      `--'    `-----' `--' `--'

      ___           ___                       ___           ___           ___
     /\  \         /\__\          ___        /\  \         /\  \         /\__\
    /::\  \       /:/ _/_        /\  \       \:\  \       /::\  \       /:/  /
   /:/\ \  \     /:/ /\__\       \:\  \       \:\  \     /:/\:\  \     /:/__/
  _\:\~\ \  \   /:/ /:/ _/_      /::\__\      /::\  \   /:/  \:\  \   /::\  \ ___
 /\ \:\ \ \__\ /:/_/:/ /\__\  __/:/\/__/     /:/\:\__\ /:/__/ \:\__\ /:/\:\  /\__\
 \:\ \:\ \/__/ \:\/:/ /:/  / /\/:/  /       /:/  \/__/ \:\  \  \/__/ \/__\:\/:/  /
  \:\ \:\__\    \::/_/:/  /  \::/__/       /:/  /       \:\  \            \::/  /
   \:\/:/  /     \:\/:/  /    \:\__\       \/__/         \:\  \           /:/  /
    \::/  /       \::/  /      \/__/                      \:\__\         /:/  /
     \/__/         \/__/                                   \/__/         \/__/    """
import IIII
ㅇ = 'i'
l = 'want'
o = 'a'
I = 'nintendo'
ㅣ = 'switch'
O = '!!!'
ㅡ = 'and'
ㄴ = 'love'
ㄱ = 'swm'
Ѓ = '!!'
ι = 'ㅎㅎ'
Γ = 'ㅎㅎㅎ'
ᚙ = 'ㅏㅏㅏㅏ'
ㅁㅁㅁㅁᚙᚙㅁㅁ = 'ㅇㄴ'
ㅁㅁᚙᚙㅁㅁ='ㅇ'
ㅁᚙᚙㅁㅁ='ㅇㄷㅈ'
ㅁᚙᚙᚙᚙ='ㅇㅈ'
ㅢ:'ㅇㅈㅂㅇ'
𪚥 = 'ㅇㅂㅈㅇ'
def IIIl(l1ll):
    if IIII.lIIl(IIII.llll(l1ll)):
        return l1ll
    살
    려
    줘

    Γㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ𪚥𪚥𪚥ㅡㅡㅡㅡ=ㄱ
    l丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥丶=ㅣ
    l丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥丶=ㅣ
    l丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶𪚥𪚥𪚥丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶=ㅣ
    ㄴㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ = ㅢ

    Γㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ=ㄱ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    l丶丶丶丶𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥𪚥丶丶丶丶丶丶𪚥𪚥𪚥𪚥丶丶丶=ㅣ
    ㄴㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ = ㅢ







    ㅁㅁㅁᚙᚙᚙᚙㅁㅁㅁㅁㅁᚙᚙᚙᚙ=ㅁᚙᚙㅁㅁ
    ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ =ㅁᚙᚙᚙᚙ
    ㅁㅁㅁᚙᚙᚙᚙᚙᚙᚙᚙᚙᚙᚙᚙㅁㅁ =ㅁᚙᚙᚙᚙ
    ㅁㅁㅁㅁㅁㅁㅁㅁᚙᚙᚙᚙㅁㅁ= ㅁᚙᚙㅁㅁ


    lllI            =         IIII.lIlI(IIII.llll(l1ll))

    llIl      =       l1ll[:lllI]
    llII = l1ll[lllI:]
    lIll = IIIl(llIl)
    lI1I = IIIl(llII)
    lIIl = lIII = IIII.lIII()
    Illl = []
    while lIIl < IIII.llll(lIll) and lIII < IIII.llll(lI1I):
        if lIll[lIIl] < lI1I[lIII]:
            IIII.lllI(Illl, lIll[lIIl])
            lIIl+=1
        else:
            IIII.lllI(Illl, lI1I[lIII])
            lIII+=1
    Illl += lIll[lIIl:]
    Illl += lI1I[lIII:]

    return Illl



print(IIIl([2,3,4,1,6,3,8]))